print('Введите номер действия (указан перед названием действия)')
print('1. Сложение     +')
print('2. Вычитание    -')
print('3. Умножение    *')
print('4. Деление      :')
n = int(input())
if n == 1:
    # 1+2
    d_1 = int(input())
    print('+')
    d_2 = int(input())
    print('—————')
    q_1_2 = d_1 + d_2
    print(q_1_2)

    # 1+2+3
    print()
    print(q_1_2)
    print('+')
    d_3 = int(input())
    print('—————')
    q_1_2_3 = d_1 + d_2 + d_3
    print(q_1_2_3)

    # 1+2+3+4
    print()
    print(q_1_2_3)
    print('+')
    d_4 = int(input())
    print('—————')
    q_1_2_3_4 = d_1 + d_2 + d_3 + d_4
    print(q_1_2_3_4)

    # 1+2+3+4+5
    print()
    print(q_1_2_3_4)
    print('+')
    d_5 = int(input())
    print('————')
    q_1_2_3_4_5 = d_1 + d_2 + d_3 + d_4 + d_5
    print(q_1_2_3_4_5)

    # 1+2+3+4+5+6
    print()
    print(q_1_2_3_4_5)
    print('+')
    d_6 = int(input())
    print('—————')
    q_1_2_3_4_5_6 = d_1 + d_2 + d_3 + d_4 + d_5 + d_6
    print(q_1_2_3_4_5_6)

    # 1+2+3+4+5+6+7
    print()
    print(q_1_2_3_4_5_6)
    print('+')
    d_7 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7 = d_1 + d_2 + d_3 + d_4 + d_5 + d_6 + d_7
    print(q_1_2_3_4_5_6_7)

    # 1+2+3+4+5+6+7+8
    print()
    print(q_1_2_3_4_5_6_7)
    print('+')
    d_8 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8 = d_1 + d_2 + d_3 + d_4 + d_5 + d_6 + d_7 + d_8
    print(q_1_2_3_4_5_6_7_8)

    # 1+2+3+4+5+6+7+8+9
    print()
    print(q_1_2_3_4_5_6_7_8)
    print('+')
    d_9 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8_9 = d_1 + d_2 + d_3 + d_4 + d_5 + d_6 + d_7 + d_8 + d_9
    print(q_1_2_3_4_5_6_7_8_9)

    # 1+2+3+4+5+6+7+8+9+10
    print()
    print(q_1_2_3_4_5_6_7_8_9)
    print('+')
    d_10 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8_9_10 = d_1 + d_2 + d_3 + d_4 + d_5 + d_6 + d_7 + d_8 + d_9 + d_10
    print(q_1_2_3_4_5_6_7_8_9_10)
if n == 2:
    # 1-2
    d_1 = int(input())
    print('-')
    d_2 = int(input())
    print('—————')
    q_1_2 = d_1 - d_2
    print(q_1_2)

    # 1-2-3
    print()
    print(q_1_2)
    print('-')
    d_3 = int(input())
    print('—————')
    q_1_2_3 = d_1 - d_2 - d_3
    print(q_1_2_3)

    # 1-2-3-4
    print()
    print(q_1_2_3)
    print('-')
    d_4 = int(input())
    print('—————')
    q_1_2_3_4 = d_1 - d_2 - d_3 - d_4
    print(q_1_2_3_4)

    # 1-2-3-4-5
    print()
    print(q_1_2_3_4)
    print('-')
    d_5 = int(input())
    print('————')
    q_1_2_3_4_5 = d_1 - d_2 - d_3 - d_4 - d_5
    print(q_1_2_3_4_5)

    # 1-2-3-4-5-6
    print()
    print(q_1_2_3_4_5)
    print('-')
    d_6 = int(input())
    print('—————')
    q_1_2_3_4_5_6 = d_1 - d_2 - d_3 - d_4 - d_5 - d_6
    print(q_1_2_3_4_5_6)

    # 1-2-3-4-5-6-7
    print()
    print(q_1_2_3_4_5_6)
    print('-')
    d_7 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7 = d_1 - d_2 - d_3 - d_4 - d_5 - d_6 - d_7
    print(q_1_2_3_4_5_6_7)

    # 1-2-3-4-5-6-7-8
    print()
    print(q_1_2_3_4_5_6_7)
    print('-')
    d_8 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8 = d_1 - d_2 - d_3 - d_4 - d_5 - d_6 - d_7 - d_8
    print(q_1_2_3_4_5_6_7_8)

    # 1-2-3-4-5-6-7-8-9
    print()
    print(q_1_2_3_4_5_6_7_8)
    print('-')
    d_9 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8_9 = d_1 - d_2 - d_3 - d_4 - d_5 - d_6 - d_7 - d_8 - d_9
    print(q_1_2_3_4_5_6_7_8_9)

    # 1-2-3-4-5-6-7-8-9-10
    print()
    print(q_1_2_3_4_5_6_7_8_9)
    print('-')
    d_10 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8_9_10 = d_1 - d_2 - d_3 - d_4 - d_5 - d_6 - d_7 - d_8 - d_9 - d_10
    print(q_1_2_3_4_5_6_7_8_9_10)
if n == 3:
    # 1*2
    d_1 = int(input())
    print('*')
    d_2 = int(input())
    print('—————')
    q_1_2 = d_1 * d_2
    print(q_1_2)

    # 1*2*3
    print()
    print(q_1_2)
    print('*')
    d_3 = int(input())
    print('—————')
    q_1_2_3 = d_1 * d_2 * d_3
    print(q_1_2_3)

    # 1*2*3*4
    print()
    print(q_1_2_3)
    print('*')
    d_4 = int(input())
    print('—————')
    q_1_2_3_4 = d_1 * d_2 * d_3 * d_4
    print(q_1_2_3_4)

    # 1*2*3*4*5
    print()
    print(q_1_2_3_4)
    print('*')
    d_5 = int(input())
    print('————')
    q_1_2_3_4_5 = d_1 * d_2 * d_3 * d_4 * d_5
    print(q_1_2_3_4_5)

    # 1*2*3*4*5*6
    print()
    print(q_1_2_3_4_5)
    print('*')
    d_6 = int(input())
    print('—————')
    q_1_2_3_4_5_6 = d_1 * d_2 * d_3 * d_4 * d_5 * d_6
    print(q_1_2_3_4_5_6)

    # 1*2*3*4*5*6*7
    print()
    print(q_1_2_3_4_5_6)
    print('*')
    d_7 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7 = d_1 * d_2 * d_3 * d_4 * d_5 * d_6 * d_7
    print(q_1_2_3_4_5_6_7)

    # 1*2*3*4*5*6*7*8
    print()
    print(q_1_2_3_4_5_6_7)
    print('*')
    d_8 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8 = d_1 * d_2 * d_3 * d_4 * d_5 * d_6 * d_7 * d_8
    print(q_1_2_3_4_5_6_7_8)

    # 1*2*3*4*5*6*7*8*9
    print()
    print(q_1_2_3_4_5_6_7_8)
    print('*')
    d_9 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8_9 = d_1 * d_2 * d_3 * d_4 * d_5 * d_6 * d_7 * d_8 * d_9
    print(q_1_2_3_4_5_6_7_8_9)

    # 1*2*3*4*5*6*7*8*9*10
    print()
    print(q_1_2_3_4_5_6_7_8_9)
    print('*')
    d_10 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8_9_10 = d_1 * d_2 * d_3 * d_4 * d_5 * d_6 * d_7 * d_8 * d_9 * d_10
    print(q_1_2_3_4_5_6_7_8_9_10)
if n == 4:
    # 1/2
    d_1 = int(input())
    print('/')
    d_2 = int(input())
    print('—————')
    q_1_2 = d_1 / d_2
    print(q_1_2)
    if d_2 == 0:
        print('Ошибка: на 0 делить нельзя.')
        print('Перезапустите программу.')

    # 1/2/3
    print()
    print(q_1_2)
    print('/')
    d_3 = int(input())
    print('—————')
    q_1_2_3 = d_1 / d_2 / d_3
    print(q_1_2_3)
    if d_3 == 0:
        print('Ошибка: на 0 делить нельзя.')
        print('Перезапустите программу.')

    # 1/2/3/4
    print()
    print(q_1_2_3)
    print('/')
    d_4 = int(input())
    print('—————')
    q_1_2_3_4 = d_1 / d_2 / d_3 / d_4
    print(q_1_2_3_4)
    if d_4 == 0:
        print('Ошибка: на 0 делить нельзя.')
        print('Перезапустите программу.')

    # 1/2/3/4/5
    print()
    print(q_1_2_3_4)
    print('/')
    d_5 = int(input())
    print('————')
    q_1_2_3_4_5 = d_1 / d_2 / d_3 / d_4 / d_5
    print(q_1_2_3_4_5)
    if d_5 == 0:
        print('Ошибка: на 0 делить нельзя.')
        print('Перезапустите программу.')

    # 1/2/3/4/5/6
    print()
    print(q_1_2_3_4_5)
    print('/')
    d_6 = int(input())
    print('—————')
    q_1_2_3_4_5_6 = d_1 / d_2 / d_3 / d_4 / d_5 / d_6
    print(q_1_2_3_4_5_6)
    if d_6 == 0:
        print('Ошибка: на 0 делить нельзя.')
        print('Перезапустите программу.')

    # 1/2/3/4/5/6/7
    print()
    print(q_1_2_3_4_5_6)
    print('/')
    d_7 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7 = d_1 / d_2 / d_3 / d_4 / d_5 / d_6 / d_7
    print(q_1_2_3_4_5_6_7)
    if d_7 == 0:
        print('Ошибка: на 0 делить нельзя.')
        print('Перезапустите программу.')

    # 1/2/3/4/5/6/7/8
    print()
    print(q_1_2_3_4_5_6_7)
    print('/')
    d_8 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8 = d_1 / d_2 / d_3 / d_4 / d_5 / d_6 / d_7 / d_8
    print(q_1_2_3_4_5_6_7_8)
    if d_8 == 0:
        print('Ошибка: на 0 делить нельзя.')
        print('Перезапустите программу.')

    # 1/2/3/4/5/6/7/8/9
    print()
    print(q_1_2_3_4_5_6_7_8)
    print('/')
    d_9 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8_9 = d_1 / d_2 / d_3 / d_4 / d_5 / d_6 / d_7 / d_8 / d_9
    print(q_1_2_3_4_5_6_7_8_9)
    if d_9 == 0:
        print('Ошибка: на 0 делить нельзя.')
        print('Перезапустите программу.')

    # 1/2/3/4/5/6/7/8/9/10
    print()
    print(q_1_2_3_4_5_6_7_8_9)
    print('/')
    d_10 = int(input())
    print('—————')
    q_1_2_3_4_5_6_7_8_9_10 = d_1 / d_2 / d_3 / d_4 / d_5 / d_6 / d_7 / d_8 / d_9 / d_10
    print(q_1_2_3_4_5_6_7_8_9_10)
    if d_10 == 0:
        print('Ошибка: на 0 делить нельзя.')
        print('Перезапустите программу.')
if n != 1:
    if n != 2:
        if n != 3:
            if n != 4:
                    print('Ошибка: введено неправильное число.')
                    print('Перезапустите программу')
