# 1*2
d_1 = int(input())
print('*')
d_2 = int(input())
print('—————')
q_1_2 = d_1 * d_2
print(q_1_2)

# 1*2*3
print()
print(q_1_2)
print('*')
d_3 = int(input())
print('—————')
q_1_2_3 = d_1 * d_2 * d_3
print(q_1_2_3)

# 1*2*3*4
print()
print(q_1_2_3)
print('*')
d_4 = int(input())
print('—————')
q_1_2_3_4 = d_1 * d_2 * d_3 * d_4
print(q_1_2_3_4)

# 1*2*3*4*5
print()
print(q_1_2_3_4)
print('*')
d_5 = int(input())
print('————')
q_1_2_3_4_5 = d_1 * d_2 * d_3 * d_4 * d_5
print(q_1_2_3_4_5)

# 1*2*3*4*5*6
print()
print(q_1_2_3_4_5)
print('*')
d_6 = int(input())
print('—————')
q_1_2_3_4_5_6 = d_1 * d_2 * d_3 * d_4 * d_5 * d_6
print(q_1_2_3_4_5_6)

# 1*2*3*4*5*6*7
print()
print(q_1_2_3_4_5_6)
print('*')
d_7 = int(input())
print('—————')
q_1_2_3_4_5_6_7 = d_1 * d_2 * d_3 * d_4 * d_5 * d_6 * d_7
print(q_1_2_3_4_5_6_7)

# 1*2*3*4*5*6*7*8
print()
print(q_1_2_3_4_5_6_7)
print('*')
d_8 = int(input())
print('—————')
q_1_2_3_4_5_6_7_8 = d_1 * d_2 * d_3 * d_4 * d_5 * d_6 * d_7 * d_8
print(q_1_2_3_4_5_6_7_8)

# 1*2*3*4*5*6*7*8*9
print()
print(q_1_2_3_4_5_6_7_8)
print('*')
d_9 = int(input())
print('—————')
q_1_2_3_4_5_6_7_8_9 = d_1 * d_2 * d_3 * d_4 * d_5 * d_6 * d_7 * d_8 * d_9
print(q_1_2_3_4_5_6_7_8_9)

# 1*2*3*4*5*6*7*8*9*10
print()
print(q_1_2_3_4_5_6_7_8_9)
print('*')
d_10 = int(input())
print('—————')
q_1_2_3_4_5_6_7_8_9_10 = d_1 * d_2 * d_3 * d_4 * d_5 * d_6 * d_7 * d_8 * d_9 * d_10
print(q_1_2_3_4_5_6_7_8_9_10)

# Завершение
print()
print()
print('————————————————————————————————————————————————————————————————')
print('Завершение')
print('Вы использовали данный калькулятор 10 раз. Пожалуйста, откройте новое окно, так как данное больше не функционирует.')
print('Приносим извинения за причинённые неудобства!')
