# Номер купе 🌶️
 # В купейном вагоне имеется 9 купе с четырьмя местами для пассажиров в каждом.
 # Напишите программу, которая определяет номер купе, в котором находится место с заданным номером (нумерация мест сквозная, начинается с 1).

# Формат входных данных
 # На вход программе подаётся целое число – место с заданным номером в вагоне.

# Формат выходных данных
 # Программа должна вывести одно число – номер купе, в котором находится указаное место.

# КОД НАЧИНАЕТСЯ СО СТРОЧКИ 15 (:15)



d_1 = int(input())
d_2 = 0 - d_1
d_3 = d_2 // 4
d_4 = 0 - d_3
n = d_4
print(n)
